mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/mb9bf46xl/common/mb9bf46xl.h
/*******************************************************************************
* BT_PWM_MODULE
*   register structur
*******************************************************************************/
typedef struct
{
    union {
        __IO uint16_t PCSR;
        struct {
            __IO  uint8_t PCSRL;
            __IO  uint8_t PCSRH;
        };
    };
        __IO  uint8_t RESERVED11[2];
    union {
        __IO uint16_t PDUT;
        struct {
            __IO  uint8_t PDUTL;
            __IO  uint8_t PDUTH;
        };
    };
        __IO  uint8_t RESERVED12[2];
    union {
        __IO uint16_t TMR;
        struct {
            __IO  uint8_t TMRL;
            __IO  uint8_t TMRH;
        };
    };
        __IO  uint8_t RESERVED13[2];
    union {
        __IO uint16_t TMCR;
        stc_bt_pwm_tmcr_field_t TMCR_f;
        struct {
            __IO  uint8_t TMCRL;
            __IO  uint8_t TMCRH;
        };
    };
        __IO  uint8_t RESERVED14[2];
    union {
        __IO  uint8_t STC;
        stc_bt_pwm_stc_field_t STC_f;
    };
    union {
        __IO  uint8_t TMCR2;
        stc_bt_pwm_tmcr2_field_t TMCR2_f;
    };
} FM_BT_PWM_TypeDef, FM4_BT_PWM_TypeDef;

/*******************************************************************************
* BT_RT_MODULE
*   register structur
*******************************************************************************/
typedef struct
{
    union {
        __IO uint16_t PCSR;
        struct {
            __IO  uint8_t PCSRL;
            __IO  uint8_t PCSRH;
        };
    };
        __IO  uint8_t RESERVED15[6];
    union {
        __IO uint16_t TMR;
        struct {
            __IO  uint8_t TMRL;
            __IO  uint8_t TMRH;
        };
    };
        __IO  uint8_t RESERVED16[2];
    union {
        __IO uint16_t TMCR;
        stc_bt_rt_tmcr_field_t TMCR_f;
        struct {
            __IO  uint8_t TMCRL;
            __IO  uint8_t TMCRH;
        };
    };
        __IO  uint8_t RESERVED17[2];
    union {
        __IO  uint8_t STC;
        stc_bt_rt_stc_field_t STC_f;
    };
    union {
        __IO  uint8_t TMCR2;
        stc_bt_rt_tmcr2_field_t TMCR2_f;
    };
} FM_BT_RT_TypeDef, FM4_BT_RT_TypeDef;

/*******************************************************************************
* BTIOSEL03_MODULE
*   register structur
*******************************************************************************/
typedef struct
{
        __IO  uint8_t RESERVED0[1];
    union {
        __IO  uint8_t BTSEL0123;
        stc_btiosel03_btsel0123_field_t BTSEL0123_f;
    };
} FM_BTIOSEL03_TypeDef, FM4_BTIOSEL03_TypeDef;

/*******************************************************************************
* BTIOSEL47_MODULE
*   register structur
*******************************************************************************/
typedef struct
{
        __IO  uint8_t RESERVED0[1];
    union {
        __IO  uint8_t BTSEL4567;
        stc_btiosel47_btsel4567_field_t BTSEL4567_f;
    };
} FM_BTIOSEL47_TypeDef, FM4_BTIOSEL47_TypeDef;

/*******************************************************************************
* CAN_MODULE
*   register structur
*******************************************************************************/
typedef struct
{
    union {
        __IO uint16_t CTRLR;
        stc_can_ctrlr_field_t CTRLR_f;
        struct {
            __IO  uint8_t CTRLRL;
            __IO  uint8_t CTRLRH;
        };
    };
    union {
        __IO uint16_t STATR;
        stc_can_statr_field_t STATR_f;
        struct {
            __IO  uint8_t STATRL;
            __IO  uint8_t STATRH;
        };
    };
    union {
        __IO uint16_t ERRCNT;
        stc_can_errcnt_field_t ERRCNT_f;
        struct {
            __IO  uint8_t ERRCNTL;
            __IO  uint8_t ERRCNTH;
        };
    };
    union {
        __IO uint16_t BTR;
        stc_can_btr_field_t BTR_f;
        struct {
            __IO  uint8_t BTRL;
            __IO  uint8_t BTRH;
        };
    };
    union {
        __IO uint16_t INTR;
        stc_can_intr_field_t INTR_f;
        struct {
            __IO  uint8_t INTRL;
            __IO  uint8_t INTRH;
        };
    };
    union {
        __IO uint16_t TESTR;
        stc_can_testr_field_t TESTR_f;
        struct {
            __IO  uint8_t TESTRL;
            __IO  uint8_t TESTRH;
        };
    };
    union {
        __IO uint16_t BRPER;
        stc_can_brper_field_t BRPER_f;
        struct {
            __IO  uint8_t BRPERL;
            __IO  uint8_t BRPERH;
        };
    };
        __IO  uint8_t RESERVED0[2];
    union {
        __IO uint16_t IF1CREQ;
        stc_can_if1creq_field_t IF1CREQ_f;
        struct {
            __IO  uint8_t IF1CREQL;
            __IO  uint8_t IF1CREQH;
        };
    };
    union {
        __IO uint16_t IF1CMSK;
        stc_can_if1cmsk_field_t IF1CMSK_f;
        struct {
            __IO  uint8_t IF1CMSKL;
            __IO  uint8_t IF1CMSKH;
        };
    };
    union {
        __IO uint32_t IF1MSK;
        stc_can_if1msk_field_t IF1MSK_f;
        struct {
          union {
            __IO uint16_t IF1MSKL;
            struct {
              __IO uint8_t IF1MSKLL;
              __IO uint8_t IF1MSKLH;
            };
          };
          union {
            __IO uint16_t IF1MSKH;
            struct {
              __IO uint8_t IF1MSKHL;
              __IO uint8_t IF1MSKHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IF1ARB;
        stc_can_if1arb_field_t IF1ARB_f;
        struct {
          union {
            __IO uint16_t IF1ARBL;
            struct {
              __IO uint8_t IF1ARBLL;
              __IO uint8_t IF1ARBLH;
            };
          };
          union {
            __IO uint16_t IF1ARBH;
            struct {
              __IO uint8_t IF1ARBHL;
              __IO uint8_t IF1ARBHH;
            };
          };
        };
    };
    union {
        __IO uint16_t IF1MCTR;
        stc_can_if1mctr_field_t IF1MCTR_f;
        struct {
            __IO  uint8_t IF1MCTRL;
            __IO  uint8_t IF1MCTRH;
        };
    };
        __IO  uint8_t RESERVED1[2];
    union {
        __IO uint32_t IF1DTA_L;
        stc_can_if1dta_l_field_t IF1DTA_L_f;
        struct {
          union {
            __IO uint16_t IF1DTA_LL;
            struct {
              __IO uint8_t IF1DTA_LLL;
              __IO uint8_t IF1DTA_LLH;
            };
          };
          union {
            __IO uint16_t IF1DTA_LH;
            struct {
              __IO uint8_t IF1DTA_LHL;
              __IO uint8_t IF1DTA_LHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IF1DTB_L;
        stc_can_if1dtb_l_field_t IF1DTB_L_f;
        struct {
          union {
            __IO uint16_t IF1DTB_LL;
            struct {
              __IO uint8_t IF1DTB_LLL;
              __IO uint8_t IF1DTB_LLH;
            };
          };
          union {
            __IO uint16_t IF1DTB_LH;
            struct {
              __IO uint8_t IF1DTB_LHL;
              __IO uint8_t IF1DTB_LHH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED2[8];
    union {
        __IO uint32_t IF1DTA_B;
        stc_can_if1dta_b_field_t IF1DTA_B_f;
        struct {
          union {
            __IO uint16_t IF1DTA_BL;
            struct {
              __IO uint8_t IF1DTA_BLL;
              __IO uint8_t IF1DTA_BLH;
            };
          };
          union {
            __IO uint16_t IF1DTA_BH;
            struct {
              __IO uint8_t IF1DTA_BHL;
              __IO uint8_t IF1DTA_BHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IF1DTB_B;
        stc_can_if1dtb_b_field_t IF1DTB_B_f;
        struct {
          union {
            __IO uint16_t IF1DTB_BL;
            struct {
              __IO uint8_t IF1DTB_BLL;
              __IO uint8_t IF1DTB_BLH;
            };
          };
          union {
            __IO uint16_t IF1DTB_BH;
            struct {
              __IO uint8_t IF1DTB_BHL;
              __IO uint8_t IF1DTB_BHH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED3[8];
    union {
        __IO uint16_t IF2CREQ;
        stc_can_if2creq_field_t IF2CREQ_f;
        struct {
            __IO  uint8_t IF2CREQL;
            __IO  uint8_t IF2CREQH;
        };
    };
    union {
        __IO uint16_t IF2CMSK;
        stc_can_if2cmsk_field_t IF2CMSK_f;
        struct {
            __IO  uint8_t IF2CMSKL;
            __IO  uint8_t IF2CMSKH;
        };
    };
    union {
        __IO uint32_t IF2MSK;
        stc_can_if2msk_field_t IF2MSK_f;
        struct {
          union {
            __IO uint16_t IF2MSKL;
            struct {
              __IO uint8_t IF2MSKLL;
              __IO uint8_t IF2MSKLH;
            };
          };
          union {
            __IO uint16_t IF2MSKH;
            struct {
              __IO uint8_t IF2MSKHL;
              __IO uint8_t IF2MSKHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IF2ARB;
        stc_can_if2arb_field_t IF2ARB_f;
        struct {
          union {
            __IO uint16_t IF2ARBL;
            struct {
              __IO uint8_t IF2ARBLL;
              __IO uint8_t IF2ARBLH;
            };
          };
          union {
            __IO uint16_t IF2ARBH;
            struct {
              __IO uint8_t IF2ARBHL;
              __IO uint8_t IF2ARBHH;
            };
          };
        };
    };
    union {
        __IO uint16_t IF2MCTR;
        stc_can_if2mctr_field_t IF2MCTR_f;
        struct {
            __IO  uint8_t IF2MCTRL;
            __IO  uint8_t IF2MCTRH;
        };
    };
        __IO  uint8_t RESERVED4[2];
    union {
        __IO uint32_t IF2DTA_L;
        stc_can_if2dta_l_field_t IF2DTA_L_f;
        struct {
          union {
            __IO uint16_t IF2DTA_LL;
            struct {
              __IO uint8_t IF2DTA_LLL;
              __IO uint8_t IF2DTA_LLH;
            };
          };
          union {
            __IO uint16_t IF2DTA_LH;
            struct {
              __IO uint8_t IF2DTA_LHL;
              __IO uint8_t IF2DTA_LHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IF2DTB_L;
        stc_can_if2dtb_l_field_t IF2DTB_L_f;
        struct {
          union {
            __IO uint16_t IF2DTB_LL;
            struct {
              __IO uint8_t IF2DTB_LLL;
              __IO uint8_t IF2DTB_LLH;
            };
          };
          union {
            __IO uint16_t IF2DTB_LH;
            struct {
              __IO uint8_t IF2DTB_LHL;
              __IO uint8_t IF2DTB_LHH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED5[8];
    union {
        __IO uint32_t IF2DTA_B;
        stc_can_if2dta_b_field_t IF2DTA_B_f;
        struct {
          union {
            __IO uint16_t IF2DTA_BL;
            struct {
              __IO uint8_t IF2DTA_BLL;
              __IO uint8_t IF2DTA_BLH;
            };
          };
          union {
            __IO uint16_t IF2DTA_BH;
            struct {
              __IO uint8_t IF2DTA_BHL;
              __IO uint8_t IF2DTA_BHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IF2DTB_B;
        stc_can_if2dtb_b_field_t IF2DTB_B_f;
        struct {
          union {
            __IO uint16_t IF2DTB_BL;
            struct {
              __IO uint8_t IF2DTB_BLL;
              __IO uint8_t IF2DTB_BLH;
            };
          };
          union {
            __IO uint16_t IF2DTB_BH;
            struct {
              __IO uint8_t IF2DTB_BHL;
              __IO uint8_t IF2DTB_BHH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED6[24];
    union {
        __IO uint32_t TREQR;
        stc_can_treqr_field_t TREQR_f;
        struct {
          union {
            __IO uint16_t TREQRL;
            struct {
              __IO uint8_t TREQRLL;
              __IO uint8_t TREQRLH;
            };
          };
          union {
            __IO uint16_t TREQRH;
            struct {
              __IO uint8_t TREQRHL;
              __IO uint8_t TREQRHH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED7[12];
    union {
        __IO uint32_t NEWDT;
        stc_can_newdt_field_t NEWDT_f;
        struct {
          union {
            __IO uint16_t NEWDTL;
            struct {
              __IO uint8_t NEWDTLL;
              __IO uint8_t NEWDTLH;
            };
          };
          union {
            __IO uint16_t NEWDTH;
            struct {
              __IO uint8_t NEWDTHL;
              __IO uint8_t NEWDTHH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED8[12];
    union {
        __IO uint32_t INTPND;
        stc_can_intpnd_field_t INTPND_f;
        struct {
          union {
            __IO uint16_t INTPNDL;
            struct {
              __IO uint8_t INTPNDLL;
              __IO uint8_t INTPNDLH;
            };
          };
          union {
            __IO uint16_t INTPNDH;
            struct {
              __IO uint8_t INTPNDHL;
              __IO uint8_t INTPNDHH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED9[12];
    union {
        __IO uint32_t MSGVAL;
        stc_can_msgval_field_t MSGVAL_f;
        struct {
          union {
            __IO uint16_t MSGVALL;
            struct {
              __IO uint8_t MSGVALLL;
              __IO uint8_t MSGVALLH;
            };
          };
          union {
            __IO uint16_t MSGVALH;
            struct {
              __IO uint8_t MSGVALHL;
              __IO uint8_t MSGVALHH;
            };
          };
        };
    };
} FM_CAN_TypeDef, FM4_CAN_TypeDef;

