mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/mb9bf46xl/common/mb9bf46xl.h
#define FM4_BT0_PPG                               ((FM_BT_PPG_TypeDef *)FM4_BT0_BASE)
#define FM_BT0_PPG                                ((FM_BT_PPG_TypeDef *)FM4_BT0_BASE)
#define FM4_BT0_PWC                               ((FM_BT_PWC_TypeDef *)FM4_BT0_BASE)
#define FM_BT0_PWC                                ((FM_BT_PWC_TypeDef *)FM4_BT0_BASE)
#define FM4_BT0_PWM                               ((FM_BT_PWM_TypeDef *)FM4_BT0_BASE)
#define FM_BT0_PWM                                ((FM_BT_PWM_TypeDef *)FM4_BT0_BASE)
#define FM4_BT0_RT                                ((FM_BT_RT_TypeDef *)FM4_BT0_BASE)
#define FM_BT0_RT                                 ((FM_BT_RT_TypeDef *)FM4_BT0_BASE)
#define FM4_BT1                                   ((FM_BT_TypeDef *)FM4_BT1_BASE)
#define FM_BT1                                    ((FM_BT_TypeDef *)FM4_BT1_BASE)
#define FM4_BT1_PPG                               ((FM_BT_PPG_TypeDef *)FM4_BT1_BASE)
#define FM_BT1_PPG                                ((FM_BT_PPG_TypeDef *)FM4_BT1_BASE)
#define FM4_BT1_PWC                               ((FM_BT_PWC_TypeDef *)FM4_BT1_BASE)
#define FM_BT1_PWC                                ((FM_BT_PWC_TypeDef *)FM4_BT1_BASE)
#define FM4_BT1_PWM                               ((FM_BT_PWM_TypeDef *)FM4_BT1_BASE)
#define FM_BT1_PWM                                ((FM_BT_PWM_TypeDef *)FM4_BT1_BASE)
#define FM4_BT1_RT                                ((FM_BT_RT_TypeDef *)FM4_BT1_BASE)
#define FM_BT1_RT                                 ((FM_BT_RT_TypeDef *)FM4_BT1_BASE)
#define FM4_BT2                                   ((FM_BT_TypeDef *)FM4_BT2_BASE)
#define FM_BT2                                    ((FM_BT_TypeDef *)FM4_BT2_BASE)
#define FM4_BT2_PPG                               ((FM_BT_PPG_TypeDef *)FM4_BT2_BASE)
#define FM_BT2_PPG                                ((FM_BT_PPG_TypeDef *)FM4_BT2_BASE)
#define FM4_BT2_PWC                               ((FM_BT_PWC_TypeDef *)FM4_BT2_BASE)
#define FM_BT2_PWC                                ((FM_BT_PWC_TypeDef *)FM4_BT2_BASE)
#define FM4_BT2_PWM                               ((FM_BT_PWM_TypeDef *)FM4_BT2_BASE)
#define FM_BT2_PWM                                ((FM_BT_PWM_TypeDef *)FM4_BT2_BASE)
#define FM4_BT2_RT                                ((FM_BT_RT_TypeDef *)FM4_BT2_BASE)
#define FM_BT2_RT                                 ((FM_BT_RT_TypeDef *)FM4_BT2_BASE)
#define FM4_BT3                                   ((FM_BT_TypeDef *)FM4_BT3_BASE)
#define FM_BT3                                    ((FM_BT_TypeDef *)FM4_BT3_BASE)
#define FM4_BT3_PPG                               ((FM_BT_PPG_TypeDef *)FM4_BT3_BASE)
#define FM_BT3_PPG                                ((FM_BT_PPG_TypeDef *)FM4_BT3_BASE)
#define FM4_BT3_PWC                               ((FM_BT_PWC_TypeDef *)FM4_BT3_BASE)
#define FM_BT3_PWC                                ((FM_BT_PWC_TypeDef *)FM4_BT3_BASE)
#define FM4_BT3_PWM                               ((FM_BT_PWM_TypeDef *)FM4_BT3_BASE)
#define FM_BT3_PWM                                ((FM_BT_PWM_TypeDef *)FM4_BT3_BASE)
#define FM4_BT3_RT                                ((FM_BT_RT_TypeDef *)FM4_BT3_BASE)
#define FM_BT3_RT                                 ((FM_BT_RT_TypeDef *)FM4_BT3_BASE)
#define FM4_BT4                                   ((FM_BT_TypeDef *)FM4_BT4_BASE)
#define FM_BT4                                    ((FM_BT_TypeDef *)FM4_BT4_BASE)
#define FM4_BT4_PPG                               ((FM_BT_PPG_TypeDef *)FM4_BT4_BASE)
#define FM_BT4_PPG                                ((FM_BT_PPG_TypeDef *)FM4_BT4_BASE)
#define FM4_BT4_PWC                               ((FM_BT_PWC_TypeDef *)FM4_BT4_BASE)
#define FM_BT4_PWC                                ((FM_BT_PWC_TypeDef *)FM4_BT4_BASE)
#define FM4_BT4_PWM                               ((FM_BT_PWM_TypeDef *)FM4_BT4_BASE)
#define FM_BT4_PWM                                ((FM_BT_PWM_TypeDef *)FM4_BT4_BASE)
#define FM4_BT4_RT                                ((FM_BT_RT_TypeDef *)FM4_BT4_BASE)
#define FM_BT4_RT                                 ((FM_BT_RT_TypeDef *)FM4_BT4_BASE)
#define FM4_BT5                                   ((FM_BT_TypeDef *)FM4_BT5_BASE)
#define FM_BT5                                    ((FM_BT_TypeDef *)FM4_BT5_BASE)
#define FM4_BT5_PPG                               ((FM_BT_PPG_TypeDef *)FM4_BT5_BASE)
#define FM_BT5_PPG                                ((FM_BT_PPG_TypeDef *)FM4_BT5_BASE)
#define FM4_BT5_PWC                               ((FM_BT_PWC_TypeDef *)FM4_BT5_BASE)
#define FM_BT5_PWC                                ((FM_BT_PWC_TypeDef *)FM4_BT5_BASE)
#define FM4_BT5_PWM                               ((FM_BT_PWM_TypeDef *)FM4_BT5_BASE)
#define FM_BT5_PWM                                ((FM_BT_PWM_TypeDef *)FM4_BT5_BASE)
#define FM4_BT5_RT                                ((FM_BT_RT_TypeDef *)FM4_BT5_BASE)
#define FM_BT5_RT                                 ((FM_BT_RT_TypeDef *)FM4_BT5_BASE)
#define FM4_BT6                                   ((FM_BT_TypeDef *)FM4_BT6_BASE)
#define FM_BT6                                    ((FM_BT_TypeDef *)FM4_BT6_BASE)
#define FM4_BT6_PPG                               ((FM_BT_PPG_TypeDef *)FM4_BT6_BASE)
#define FM_BT6_PPG                                ((FM_BT_PPG_TypeDef *)FM4_BT6_BASE)
#define FM4_BT6_PWC                               ((FM_BT_PWC_TypeDef *)FM4_BT6_BASE)
#define FM_BT6_PWC                                ((FM_BT_PWC_TypeDef *)FM4_BT6_BASE)
#define FM4_BT6_PWM                               ((FM_BT_PWM_TypeDef *)FM4_BT6_BASE)
#define FM_BT6_PWM                                ((FM_BT_PWM_TypeDef *)FM4_BT6_BASE)
#define FM4_BT6_RT                                ((FM_BT_RT_TypeDef *)FM4_BT6_BASE)
#define FM_BT6_RT                                 ((FM_BT_RT_TypeDef *)FM4_BT6_BASE)
#define FM4_BT7                                   ((FM_BT_TypeDef *)FM4_BT7_BASE)
#define FM_BT7                                    ((FM_BT_TypeDef *)FM4_BT7_BASE)
#define FM4_BT7_PPG                               ((FM_BT_PPG_TypeDef *)FM4_BT7_BASE)
#define FM_BT7_PPG                                ((FM_BT_PPG_TypeDef *)FM4_BT7_BASE)
#define FM4_BT7_PWC                               ((FM_BT_PWC_TypeDef *)FM4_BT7_BASE)
#define FM_BT7_PWC                                ((FM_BT_PWC_TypeDef *)FM4_BT7_BASE)
#define FM4_BT7_PWM                               ((FM_BT_PWM_TypeDef *)FM4_BT7_BASE)
#define FM_BT7_PWM                                ((FM_BT_PWM_TypeDef *)FM4_BT7_BASE)
#define FM4_BT7_RT                                ((FM_BT_RT_TypeDef *)FM4_BT7_BASE)
#define FM_BT7_RT                                 ((FM_BT_RT_TypeDef *)FM4_BT7_BASE)
#define FM4_BTIOSEL03                             ((FM_BTIOSEL03_TypeDef *)FM4_BTIOSEL03_BASE)
#define FM_BTIOSEL03                              ((FM_BTIOSEL03_TypeDef *)FM4_BTIOSEL03_BASE)
#define FM4_BTIOSEL47                             ((FM_BTIOSEL47_TypeDef *)FM4_BTIOSEL47_BASE)
#define FM_BTIOSEL47                              ((FM_BTIOSEL47_TypeDef *)FM4_BTIOSEL47_BASE)
#define FM4_CAN0                                  ((FM_CAN_TypeDef *)FM4_CAN0_BASE)
#define FM_CAN0                                   ((FM_CAN_TypeDef *)FM4_CAN0_BASE)
#define FM4_CANPRES                               ((FM_CANPRES_TypeDef *)FM4_CANPRES_BASE)
#define FM_CANPRES                                ((FM_CANPRES_TypeDef *)FM4_CANPRES_BASE)
#define FM4_CLK_GATING                            ((FM_CLK_GATING_TypeDef *)FM4_CLK_GATING_BASE)
#define FM_CLK_GATING                             ((FM_CLK_GATING_TypeDef *)FM4_CLK_GATING_BASE)
#define FM4_CRC                                   ((FM_CRC_TypeDef *)FM4_CRC_BASE)
#define FM_CRC                                    ((FM_CRC_TypeDef *)FM4_CRC_BASE)
#define FM4_CRG                                   ((FM_CRG_TypeDef *)FM4_CRG_BASE)
#define FM_CRG                                    ((FM_CRG_TypeDef *)FM4_CRG_BASE)
#define FM4_CRTRIM                                ((FM_CRTRIM_TypeDef *)FM4_CRTRIM_BASE)
#define FM_CRTRIM                                 ((FM_CRTRIM_TypeDef *)FM4_CRTRIM_BASE)
#define FM4_DAC0                                  ((FM_DAC_TypeDef *)FM4_DAC0_BASE)
#define FM_DAC0                                   ((FM_DAC_TypeDef *)FM4_DAC0_BASE)
#define FM4_DAC1                                  ((FM_DAC_TypeDef *)FM4_DAC1_BASE)
#define FM_DAC1                                   ((FM_DAC_TypeDef *)FM4_DAC1_BASE)
#define FM4_DMAC                                  ((FM_DMAC_TypeDef *)FM4_DMAC_BASE)
#define FM_DMAC                                   ((FM_DMAC_TypeDef *)FM4_DMAC_BASE)
#define FM4_DS                                    ((FM_DS_TypeDef *)FM4_DS_BASE)
#define FM_DS                                     ((FM_DS_TypeDef *)FM4_DS_BASE)
#define FM4_DSTC                                  ((FM_DSTC_TypeDef *)FM4_DSTC_BASE)
#define FM_DSTC                                   ((FM_DSTC_TypeDef *)FM4_DSTC_BASE)
#define FM4_DT                                    ((FM_DT_TypeDef *)FM4_DT_BASE)
#define FM_DT                                     ((FM_DT_TypeDef *)FM4_DT_BASE)
#define FM4_ECC_CAPTURE                           ((FM_ECC_CAPTURE_TypeDef *)FM4_ECC_CAPTURE_BASE)
#define FM_ECC_CAPTURE                            ((FM_ECC_CAPTURE_TypeDef *)FM4_ECC_CAPTURE_BASE)
#define FM4_EXTI                                  ((FM_EXTI_TypeDef *)FM4_EXTI_BASE)
#define FM_EXTI                                   ((FM_EXTI_TypeDef *)FM4_EXTI_BASE)
#define FM4_FLASH_IF                              ((FM_FLASH_IF_TypeDef *)FM4_FLASH_IF_BASE)
#define FM_FLASH_IF                               ((FM_FLASH_IF_TypeDef *)FM4_FLASH_IF_BASE)
#define FM4_GPIO                                  ((FM_GPIO_TypeDef *)FM4_GPIO_BASE)
#define FM_GPIO                                   ((FM_GPIO_TypeDef *)FM4_GPIO_BASE)
#define FM4_HWWDT                                 ((FM_HWWDT_TypeDef *)FM4_HWWDT_BASE)
#define FM_HWWDT                                  ((FM_HWWDT_TypeDef *)FM4_HWWDT_BASE)
#define FM4_INTREQ                                ((FM_INTREQ_TypeDef *)FM4_INTREQ_BASE)
#define FM_INTREQ                                 ((FM_INTREQ_TypeDef *)FM4_INTREQ_BASE)
#define FM4_LSCRP                                 ((FM_LSCRP_TypeDef *)FM4_LSCRP_BASE)
#define FM_LSCRP                                  ((FM_LSCRP_TypeDef *)FM4_LSCRP_BASE)
#define FM4_LVD                                   ((FM_LVD_TypeDef *)FM4_LVD_BASE)
#define FM_LVD                                    ((FM_LVD_TypeDef *)FM4_LVD_BASE)
#define FM4_MFS0                                  ((FM_MFS_TypeDef *)FM4_MFS0_BASE)
#define FM_MFS0                                   ((FM_MFS_TypeDef *)FM4_MFS0_BASE)
#define FM4_MFS0_CSIO                             ((FM_MFS_CSIO_TypeDef *)FM4_MFS0_BASE)
#define FM_MFS0_CSIO                              ((FM_MFS_CSIO_TypeDef *)FM4_MFS0_BASE)
#define FM4_MFS0_I2C                              ((FM_MFS_I2C_TypeDef *)FM4_MFS0_BASE)
#define FM_MFS0_I2C                               ((FM_MFS_I2C_TypeDef *)FM4_MFS0_BASE)
#define FM4_MFS0_LIN                              ((FM_MFS_LIN_TypeDef *)FM4_MFS0_BASE)
#define FM_MFS0_LIN                               ((FM_MFS_LIN_TypeDef *)FM4_MFS0_BASE)
#define FM4_MFS0_UART                             ((FM_MFS_UART_TypeDef *)FM4_MFS0_BASE)
#define FM_MFS0_UART                              ((FM_MFS_UART_TypeDef *)FM4_MFS0_BASE)
#define FM4_MFS1                                  ((FM_MFS_TypeDef *)FM4_MFS1_BASE)
#define FM_MFS1                                   ((FM_MFS_TypeDef *)FM4_MFS1_BASE)
#define FM4_MFS1_CSIO                             ((FM_MFS_CSIO_TypeDef *)FM4_MFS1_BASE)
#define FM_MFS1_CSIO                              ((FM_MFS_CSIO_TypeDef *)FM4_MFS1_BASE)
#define FM4_MFS1_I2C                              ((FM_MFS_I2C_TypeDef *)FM4_MFS1_BASE)
#define FM_MFS1_I2C                               ((FM_MFS_I2C_TypeDef *)FM4_MFS1_BASE)
#define FM4_MFS1_LIN                              ((FM_MFS_LIN_TypeDef *)FM4_MFS1_BASE)
#define FM_MFS1_LIN                               ((FM_MFS_LIN_TypeDef *)FM4_MFS1_BASE)
#define FM4_MFS1_UART                             ((FM_MFS_UART_TypeDef *)FM4_MFS1_BASE)
#define FM_MFS1_UART                              ((FM_MFS_UART_TypeDef *)FM4_MFS1_BASE)
#define FM4_MFS2                                  ((FM_MFS_TypeDef *)FM4_MFS2_BASE)
#define FM_MFS2                                   ((FM_MFS_TypeDef *)FM4_MFS2_BASE)
#define FM4_MFS2_CSIO                             ((FM_MFS_CSIO_TypeDef *)FM4_MFS2_BASE)
#define FM_MFS2_CSIO                              ((FM_MFS_CSIO_TypeDef *)FM4_MFS2_BASE)
#define FM4_MFS2_I2C                              ((FM_MFS_I2C_TypeDef *)FM4_MFS2_BASE)
#define FM_MFS2_I2C                               ((FM_MFS_I2C_TypeDef *)FM4_MFS2_BASE)
#define FM4_MFS2_LIN                              ((FM_MFS_LIN_TypeDef *)FM4_MFS2_BASE)
#define FM_MFS2_LIN                               ((FM_MFS_LIN_TypeDef *)FM4_MFS2_BASE)
#define FM4_MFS2_UART                             ((FM_MFS_UART_TypeDef *)FM4_MFS2_BASE)
#define FM_MFS2_UART                              ((FM_MFS_UART_TypeDef *)FM4_MFS2_BASE)
#define FM4_MFS3                                  ((FM_MFS_TypeDef *)FM4_MFS3_BASE)
#define FM_MFS3                                   ((FM_MFS_TypeDef *)FM4_MFS3_BASE)
#define FM4_MFS3_CSIO                             ((FM_MFS_CSIO_TypeDef *)FM4_MFS3_BASE)
#define FM_MFS3_CSIO                              ((FM_MFS_CSIO_TypeDef *)FM4_MFS3_BASE)
#define FM4_MFS3_I2C                              ((FM_MFS_I2C_TypeDef *)FM4_MFS3_BASE)
#define FM_MFS3_I2C                               ((FM_MFS_I2C_TypeDef *)FM4_MFS3_BASE)
#define FM4_MFS3_LIN                              ((FM_MFS_LIN_TypeDef *)FM4_MFS3_BASE)
#define FM_MFS3_LIN                               ((FM_MFS_LIN_TypeDef *)FM4_MFS3_BASE)
#define FM4_MFS3_UART                             ((FM_MFS_UART_TypeDef *)FM4_MFS3_BASE)
#define FM_MFS3_UART                              ((FM_MFS_UART_TypeDef *)FM4_MFS3_BASE)
#define FM4_MFS4                                  ((FM_MFS_TypeDef *)FM4_MFS4_BASE)
#define FM_MFS4                                   ((FM_MFS_TypeDef *)FM4_MFS4_BASE)
#define FM4_MFS4_CSIO                             ((FM_MFS_CSIO_TypeDef *)FM4_MFS4_BASE)
#define FM_MFS4_CSIO                              ((FM_MFS_CSIO_TypeDef *)FM4_MFS4_BASE)
#define FM4_MFS4_I2C                              ((FM_MFS_I2C_TypeDef *)FM4_MFS4_BASE)
#define FM_MFS4_I2C                               ((FM_MFS_I2C_TypeDef *)FM4_MFS4_BASE)
#define FM4_MFS4_LIN                              ((FM_MFS_LIN_TypeDef *)FM4_MFS4_BASE)
#define FM_MFS4_LIN                               ((FM_MFS_LIN_TypeDef *)FM4_MFS4_BASE)
#define FM4_MFS4_UART                             ((FM_MFS_UART_TypeDef *)FM4_MFS4_BASE)
#define FM_MFS4_UART                              ((FM_MFS_UART_TypeDef *)FM4_MFS4_BASE)
#define FM4_MFS5                                  ((FM_MFS_TypeDef *)FM4_MFS5_BASE)
#define FM_MFS5                                   ((FM_MFS_TypeDef *)FM4_MFS5_BASE)
#define FM4_MFS5_CSIO                             ((FM_MFS_CSIO_TypeDef *)FM4_MFS5_BASE)
#define FM_MFS5_CSIO                              ((FM_MFS_CSIO_TypeDef *)FM4_MFS5_BASE)
#define FM4_MFS5_I2C                              ((FM_MFS_I2C_TypeDef *)FM4_MFS5_BASE)
#define FM_MFS5_I2C                               ((FM_MFS_I2C_TypeDef *)FM4_MFS5_BASE)
#define FM4_MFS5_LIN                              ((FM_MFS_LIN_TypeDef *)FM4_MFS5_BASE)
#define FM_MFS5_LIN                               ((FM_MFS_LIN_TypeDef *)FM4_MFS5_BASE)
#define FM4_MFS5_UART                             ((FM_MFS_UART_TypeDef *)FM4_MFS5_BASE)
#define FM_MFS5_UART                              ((FM_MFS_UART_TypeDef *)FM4_MFS5_BASE)
#define FM4_MFT_PPG                               ((FM_MFT_PPG_TypeDef *)FM4_MFT_PPG_BASE)
#define FM_MFT_PPG                                ((FM_MFT_PPG_TypeDef *)FM4_MFT_PPG_BASE)
#define FM4_MFT0                                  ((FM_MFT_TypeDef *)FM4_MFT0_BASE)
#define FM_MFT0                                   ((FM_MFT_TypeDef *)FM4_MFT0_BASE)
#define FM4_MFT0_ADCMP                            ((FM_MFT_ADCMP_TypeDef *)FM4_MFT0_BASE)
#define FM_MFT0_ADCMP                             ((FM_MFT_ADCMP_TypeDef *)FM4_MFT0_BASE)
#define FM4_MFT0_FRT                              ((FM_MFT_FRT_TypeDef *)FM4_MFT0_BASE)
#define FM_MFT0_FRT                               ((FM_MFT_FRT_TypeDef *)FM4_MFT0_BASE)
#define FM4_MFT0_ICU                              ((FM_MFT_ICU_TypeDef *)FM4_MFT0_BASE)
#define FM_MFT0_ICU                               ((FM_MFT_ICU_TypeDef *)FM4_MFT0_BASE)
#define FM4_MFT0_OCU                              ((FM_MFT_OCU_TypeDef *)FM4_MFT0_BASE)
#define FM_MFT0_OCU                               ((FM_MFT_OCU_TypeDef *)FM4_MFT0_BASE)
#define FM4_MFT0_WFG                              ((FM_MFT_WFG_TypeDef *)FM4_MFT0_BASE)
#define FM_MFT0_WFG                               ((FM_MFT_WFG_TypeDef *)FM4_MFT0_BASE)
#define FM4_MFT1                                  ((FM_MFT_TypeDef *)FM4_MFT1_BASE)
#define FM_MFT1                                   ((FM_MFT_TypeDef *)FM4_MFT1_BASE)
#define FM4_MFT1_ADCMP                            ((FM_MFT_ADCMP_TypeDef *)FM4_MFT1_BASE)
#define FM_MFT1_ADCMP                             ((FM_MFT_ADCMP_TypeDef *)FM4_MFT1_BASE)
#define FM4_MFT1_FRT                              ((FM_MFT_FRT_TypeDef *)FM4_MFT1_BASE)
#define FM_MFT1_FRT                               ((FM_MFT_FRT_TypeDef *)FM4_MFT1_BASE)
#define FM4_MFT1_ICU                              ((FM_MFT_ICU_TypeDef *)FM4_MFT1_BASE)
#define FM_MFT1_ICU                               ((FM_MFT_ICU_TypeDef *)FM4_MFT1_BASE)
#define FM4_MFT1_OCU                              ((FM_MFT_OCU_TypeDef *)FM4_MFT1_BASE)
#define FM_MFT1_OCU                               ((FM_MFT_OCU_TypeDef *)FM4_MFT1_BASE)
#define FM4_MFT1_WFG                              ((FM_MFT_WFG_TypeDef *)FM4_MFT1_BASE)
#define FM_MFT1_WFG                               ((FM_MFT_WFG_TypeDef *)FM4_MFT1_BASE)
#define FM4_QPRC0                                 ((FM_QPRC_TypeDef *)FM4_QPRC0_BASE)
#define FM_QPRC0                                  ((FM_QPRC_TypeDef *)FM4_QPRC0_BASE)
#define FM4_QPRC0_NF                              ((FM_QPRC_NF_TypeDef *)FM4_QPRC0_NF_BASE)
#define FM_QPRC0_NF                               ((FM_QPRC_NF_TypeDef *)FM4_QPRC0_NF_BASE)
#define FM4_RTC                                   ((FM_RTC_TypeDef *)FM4_RTC_BASE)
#define FM_RTC                                    ((FM_RTC_TypeDef *)FM4_RTC_BASE)
#define FM4_SBSSR                                 ((FM_SBSSR_TypeDef *)FM4_SBSSR_BASE)
#define FM_SBSSR                                  ((FM_SBSSR_TypeDef *)FM4_SBSSR_BASE)
#define FM4_SWWDT                                 ((FM_SWWDT_TypeDef *)FM4_SWWDT_BASE)
#define FM_SWWDT                                  ((FM_SWWDT_TypeDef *)FM4_SWWDT_BASE)
#define FM4_UNIQUE_ID                             ((FM_UNIQUE_ID_TypeDef *)FM4_UNIQUE_ID_BASE)
#define FM_UNIQUE_ID                              ((FM_UNIQUE_ID_TypeDef *)FM4_UNIQUE_ID_BASE)
#define FM4_WC                                    ((FM_WC_TypeDef *)FM4_WC_BASE)
#define FM_WC                                     ((FM_WC_TypeDef *)FM4_WC_BASE)
#define FM4_WORKFLASH_IF                          ((FM_WORKFLASH_IF_TypeDef *)FM4_WORKFLASH_IF_BASE)
#define FM_WORKFLASH_IF                           ((FM_WORKFLASH_IF_TypeDef *)FM4_WORKFLASH_IF_BASE)
/*******************************************************************************
* Register Definitions
*******************************************************************************/
/*******************************************************************************
* ADC Registers ADC0
*   Register Definition
*******************************************************************************/
#define FM_ADC0_ADSR                              *((volatile  uint8_t*)(0x40027000UL))
#define FM4_ADC0_ADSR                             *((volatile  uint8_t*)(0x40027000UL))
#define FM_ADC0_ADCR                              *((volatile  uint8_t*)(0x40027001UL))
#define FM4_ADC0_ADCR                             *((volatile  uint8_t*)(0x40027001UL))
#define FM_ADC0_SFNS                              *((volatile  uint8_t*)(0x40027008UL))
#define FM4_ADC0_SFNS                             *((volatile  uint8_t*)(0x40027008UL))
#define FM_ADC0_SCCR                              *((volatile  uint8_t*)(0x40027009UL))
#define FM4_ADC0_SCCR                             *((volatile  uint8_t*)(0x40027009UL))
#define FM_ADC0_SCFD                              *((volatile uint32_t*)(0x4002700CUL))
#define FM4_ADC0_SCFD                             *((volatile uint32_t*)(0x4002700CUL))
#define FM_ADC0_SCFD_FDAS1                        *((volatile uint32_t*)(0x4002700CUL))
#define FM4_ADC0_SCFD_FDAS1                       *((volatile uint32_t*)(0x4002700CUL))
#define FM_ADC0_SCIS23                            *((volatile uint16_t*)(0x40027010UL))
#define FM4_ADC0_SCIS23                           *((volatile uint16_t*)(0x40027010UL))
#define FM_ADC0_SCIS01                            *((volatile uint16_t*)(0x40027014UL))
#define FM4_ADC0_SCIS01                           *((volatile uint16_t*)(0x40027014UL))
#define FM_ADC0_PFNS                              *((volatile  uint8_t*)(0x40027018UL))
#define FM4_ADC0_PFNS                             *((volatile  uint8_t*)(0x40027018UL))
#define FM_ADC0_PCCR                              *((volatile  uint8_t*)(0x40027019UL))
#define FM4_ADC0_PCCR                             *((volatile  uint8_t*)(0x40027019UL))
#define FM_ADC0_PCFD                              *((volatile uint32_t*)(0x4002701CUL))
#define FM4_ADC0_PCFD                             *((volatile uint32_t*)(0x4002701CUL))
#define FM_ADC0_PCFD_FDAS1                        *((volatile uint32_t*)(0x4002701CUL))
#define FM4_ADC0_PCFD_FDAS1                       *((volatile uint32_t*)(0x4002701CUL))
#define FM_ADC0_PCIS                              *((volatile  uint8_t*)(0x40027020UL))
#define FM4_ADC0_PCIS                             *((volatile  uint8_t*)(0x40027020UL))
#define FM_ADC0_CMPCR                             *((volatile  uint8_t*)(0x40027024UL))
#define FM4_ADC0_CMPCR                            *((volatile  uint8_t*)(0x40027024UL))
#define FM_ADC0_CMPD                              *((volatile uint16_t*)(0x40027026UL))
#define FM4_ADC0_CMPD                             *((volatile uint16_t*)(0x40027026UL))
#define FM_ADC0_ADSS23                            *((volatile uint16_t*)(0x40027028UL))
#define FM4_ADC0_ADSS23                           *((volatile uint16_t*)(0x40027028UL))
#define FM_ADC0_ADSS01                            *((volatile uint16_t*)(0x4002702CUL))
#define FM4_ADC0_ADSS01                           *((volatile uint16_t*)(0x4002702CUL))
#define FM_ADC0_ADST01                            *((volatile uint16_t*)(0x40027030UL))
#define FM4_ADC0_ADST01                           *((volatile uint16_t*)(0x40027030UL))
#define FM_ADC0_ADCT                              *((volatile  uint8_t*)(0x40027034UL))
#define FM4_ADC0_ADCT                             *((volatile  uint8_t*)(0x40027034UL))
#define FM_ADC0_PRTSL                             *((volatile  uint8_t*)(0x40027038UL))
#define FM4_ADC0_PRTSL                            *((volatile  uint8_t*)(0x40027038UL))
#define FM_ADC0_SCTSL                             *((volatile  uint8_t*)(0x40027039UL))
#define FM4_ADC0_SCTSL                            *((volatile  uint8_t*)(0x40027039UL))
#define FM_ADC0_ADCEN                             *((volatile uint16_t*)(0x4002703CUL))
#define FM4_ADC0_ADCEN                            *((volatile uint16_t*)(0x4002703CUL))
