mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/mb9bf46xl/common/mb9bf46xl.h
#define bFM_GPIO_PFR2_P0                          *((volatile  uint8_t *)(0x42DE0100UL))
#define bFM4_GPIO_PFR2_P0                         *((volatile  uint8_t *)(0x42DE0100UL))
#define bFM_GPIO_PFR2_P1                          *((volatile  uint8_t *)(0x42DE0104UL))
#define bFM4_GPIO_PFR2_P1                         *((volatile  uint8_t *)(0x42DE0104UL))
#define bFM_GPIO_PFR2_P2                          *((volatile  uint8_t *)(0x42DE0108UL))
#define bFM4_GPIO_PFR2_P2                         *((volatile  uint8_t *)(0x42DE0108UL))
#define bFM_GPIO_PFR2_P3                          *((volatile  uint8_t *)(0x42DE010CUL))
#define bFM4_GPIO_PFR2_P3                         *((volatile  uint8_t *)(0x42DE010CUL))
#define bFM_GPIO_PFR2_P4                          *((volatile  uint8_t *)(0x42DE0110UL))
#define bFM4_GPIO_PFR2_P4                         *((volatile  uint8_t *)(0x42DE0110UL))
#define bFM_GPIO_PFR2_P5                          *((volatile  uint8_t *)(0x42DE0114UL))
#define bFM4_GPIO_PFR2_P5                         *((volatile  uint8_t *)(0x42DE0114UL))
#define bFM_GPIO_PFR2_P6                          *((volatile  uint8_t *)(0x42DE0118UL))
#define bFM4_GPIO_PFR2_P6                         *((volatile  uint8_t *)(0x42DE0118UL))

#define bFM_GPIO_PFR3_P0                          *((volatile  uint8_t *)(0x42DE0180UL))
#define bFM4_GPIO_PFR3_P0                         *((volatile  uint8_t *)(0x42DE0180UL))
#define bFM_GPIO_PFR3_P1                          *((volatile  uint8_t *)(0x42DE0184UL))
#define bFM4_GPIO_PFR3_P1                         *((volatile  uint8_t *)(0x42DE0184UL))
#define bFM_GPIO_PFR3_P2                          *((volatile  uint8_t *)(0x42DE0188UL))
#define bFM4_GPIO_PFR3_P2                         *((volatile  uint8_t *)(0x42DE0188UL))
#define bFM_GPIO_PFR3_P3                          *((volatile  uint8_t *)(0x42DE018CUL))
#define bFM4_GPIO_PFR3_P3                         *((volatile  uint8_t *)(0x42DE018CUL))
#define bFM_GPIO_PFR3_P4                          *((volatile  uint8_t *)(0x42DE0190UL))
#define bFM4_GPIO_PFR3_P4                         *((volatile  uint8_t *)(0x42DE0190UL))
#define bFM_GPIO_PFR3_P5                          *((volatile  uint8_t *)(0x42DE0194UL))
#define bFM4_GPIO_PFR3_P5                         *((volatile  uint8_t *)(0x42DE0194UL))

#define bFM_GPIO_PFR4_P0                          *((volatile  uint8_t *)(0x42DE0200UL))
#define bFM4_GPIO_PFR4_P0                         *((volatile  uint8_t *)(0x42DE0200UL))
#define bFM_GPIO_PFR4_P1                          *((volatile  uint8_t *)(0x42DE0204UL))
#define bFM4_GPIO_PFR4_P1                         *((volatile  uint8_t *)(0x42DE0204UL))
#define bFM_GPIO_PFR4_P6                          *((volatile  uint8_t *)(0x42DE0218UL))
#define bFM4_GPIO_PFR4_P6                         *((volatile  uint8_t *)(0x42DE0218UL))
#define bFM_GPIO_PFR4_P7                          *((volatile  uint8_t *)(0x42DE021CUL))
#define bFM4_GPIO_PFR4_P7                         *((volatile  uint8_t *)(0x42DE021CUL))
#define bFM_GPIO_PFR4_P8                          *((volatile  uint8_t *)(0x42DE0220UL))
#define bFM4_GPIO_PFR4_P8                         *((volatile  uint8_t *)(0x42DE0220UL))
#define bFM_GPIO_PFR4_P9                          *((volatile  uint8_t *)(0x42DE0224UL))
#define bFM4_GPIO_PFR4_P9                         *((volatile  uint8_t *)(0x42DE0224UL))

#define bFM_GPIO_PFR5_P0                          *((volatile  uint8_t *)(0x42DE0280UL))
#define bFM4_GPIO_PFR5_P0                         *((volatile  uint8_t *)(0x42DE0280UL))
#define bFM_GPIO_PFR5_P1                          *((volatile  uint8_t *)(0x42DE0284UL))
#define bFM4_GPIO_PFR5_P1                         *((volatile  uint8_t *)(0x42DE0284UL))
#define bFM_GPIO_PFR5_P2                          *((volatile  uint8_t *)(0x42DE0288UL))
#define bFM4_GPIO_PFR5_P2                         *((volatile  uint8_t *)(0x42DE0288UL))
#define bFM_GPIO_PFR5_P3                          *((volatile  uint8_t *)(0x42DE028CUL))
#define bFM4_GPIO_PFR5_P3                         *((volatile  uint8_t *)(0x42DE028CUL))
#define bFM_GPIO_PFR5_P4                          *((volatile  uint8_t *)(0x42DE0290UL))
#define bFM4_GPIO_PFR5_P4                         *((volatile  uint8_t *)(0x42DE0290UL))
#define bFM_GPIO_PFR5_P5                          *((volatile  uint8_t *)(0x42DE0294UL))
#define bFM4_GPIO_PFR5_P5                         *((volatile  uint8_t *)(0x42DE0294UL))
#define bFM_GPIO_PFR5_P6                          *((volatile  uint8_t *)(0x42DE0298UL))
#define bFM4_GPIO_PFR5_P6                         *((volatile  uint8_t *)(0x42DE0298UL))
#define bFM_GPIO_PFR5_P7                          *((volatile  uint8_t *)(0x42DE029CUL))
#define bFM4_GPIO_PFR5_P7                         *((volatile  uint8_t *)(0x42DE029CUL))

#define bFM_GPIO_PFR6_P0                          *((volatile  uint8_t *)(0x42DE0300UL))
#define bFM4_GPIO_PFR6_P0                         *((volatile  uint8_t *)(0x42DE0300UL))
#define bFM_GPIO_PFR6_P1                          *((volatile  uint8_t *)(0x42DE0304UL))
#define bFM4_GPIO_PFR6_P1                         *((volatile  uint8_t *)(0x42DE0304UL))
#define bFM_GPIO_PFR6_P2                          *((volatile  uint8_t *)(0x42DE0308UL))
#define bFM4_GPIO_PFR6_P2                         *((volatile  uint8_t *)(0x42DE0308UL))
#define bFM_GPIO_PFR6_P3                          *((volatile  uint8_t *)(0x42DE030CUL))
#define bFM4_GPIO_PFR6_P3                         *((volatile  uint8_t *)(0x42DE030CUL))
#define bFM_GPIO_PFR6_P4                          *((volatile  uint8_t *)(0x42DE0310UL))
#define bFM4_GPIO_PFR6_P4                         *((volatile  uint8_t *)(0x42DE0310UL))
#define bFM_GPIO_PFR6_P5                          *((volatile  uint8_t *)(0x42DE0314UL))
#define bFM4_GPIO_PFR6_P5                         *((volatile  uint8_t *)(0x42DE0314UL))
#define bFM_GPIO_PFR6_P6                          *((volatile  uint8_t *)(0x42DE0318UL))
#define bFM4_GPIO_PFR6_P6                         *((volatile  uint8_t *)(0x42DE0318UL))

#define bFM_GPIO_PFR8_P0                          *((volatile  uint8_t *)(0x42DE0400UL))
#define bFM4_GPIO_PFR8_P0                         *((volatile  uint8_t *)(0x42DE0400UL))
#define bFM_GPIO_PFR8_P1                          *((volatile  uint8_t *)(0x42DE0404UL))
#define bFM4_GPIO_PFR8_P1                         *((volatile  uint8_t *)(0x42DE0404UL))

#define bFM_GPIO_PFRE_P0                          *((volatile  uint8_t *)(0x42DE0700UL))
#define bFM4_GPIO_PFRE_P0                         *((volatile  uint8_t *)(0x42DE0700UL))
#define bFM_GPIO_PFRE_P2                          *((volatile  uint8_t *)(0x42DE0708UL))
#define bFM4_GPIO_PFRE_P2                         *((volatile  uint8_t *)(0x42DE0708UL))
#define bFM_GPIO_PFRE_P3                          *((volatile  uint8_t *)(0x42DE070CUL))
#define bFM4_GPIO_PFRE_P3                         *((volatile  uint8_t *)(0x42DE070CUL))

#define bFM_GPIO_PZR0_P0                          *((volatile  uint8_t *)(0x42DEE000UL))
#define bFM4_GPIO_PZR0_P0                         *((volatile  uint8_t *)(0x42DEE000UL))
#define bFM_GPIO_PZR0_P1                          *((volatile  uint8_t *)(0x42DEE004UL))
#define bFM4_GPIO_PZR0_P1                         *((volatile  uint8_t *)(0x42DEE004UL))
#define bFM_GPIO_PZR0_P2                          *((volatile  uint8_t *)(0x42DEE008UL))
#define bFM4_GPIO_PZR0_P2                         *((volatile  uint8_t *)(0x42DEE008UL))
#define bFM_GPIO_PZR0_P3                          *((volatile  uint8_t *)(0x42DEE00CUL))
#define bFM4_GPIO_PZR0_P3                         *((volatile  uint8_t *)(0x42DEE00CUL))
#define bFM_GPIO_PZR0_P4                          *((volatile  uint8_t *)(0x42DEE010UL))
#define bFM4_GPIO_PZR0_P4                         *((volatile  uint8_t *)(0x42DEE010UL))

#define bFM_GPIO_PZR1_P0                          *((volatile  uint8_t *)(0x42DEE080UL))
#define bFM4_GPIO_PZR1_P0                         *((volatile  uint8_t *)(0x42DEE080UL))
#define bFM_GPIO_PZR1_P1                          *((volatile  uint8_t *)(0x42DEE084UL))
#define bFM4_GPIO_PZR1_P1                         *((volatile  uint8_t *)(0x42DEE084UL))
#define bFM_GPIO_PZR1_P2                          *((volatile  uint8_t *)(0x42DEE088UL))
#define bFM4_GPIO_PZR1_P2                         *((volatile  uint8_t *)(0x42DEE088UL))
#define bFM_GPIO_PZR1_P3                          *((volatile  uint8_t *)(0x42DEE08CUL))
#define bFM4_GPIO_PZR1_P3                         *((volatile  uint8_t *)(0x42DEE08CUL))

#define bFM_GPIO_PZR2_P0                          *((volatile  uint8_t *)(0x42DEE100UL))
#define bFM4_GPIO_PZR2_P0                         *((volatile  uint8_t *)(0x42DEE100UL))
#define bFM_GPIO_PZR2_P1                          *((volatile  uint8_t *)(0x42DEE104UL))
#define bFM4_GPIO_PZR2_P1                         *((volatile  uint8_t *)(0x42DEE104UL))
#define bFM_GPIO_PZR2_P2                          *((volatile  uint8_t *)(0x42DEE108UL))
#define bFM4_GPIO_PZR2_P2                         *((volatile  uint8_t *)(0x42DEE108UL))
#define bFM_GPIO_PZR2_P3                          *((volatile  uint8_t *)(0x42DEE10CUL))
#define bFM4_GPIO_PZR2_P3                         *((volatile  uint8_t *)(0x42DEE10CUL))
#define bFM_GPIO_PZR2_P4                          *((volatile  uint8_t *)(0x42DEE110UL))
#define bFM4_GPIO_PZR2_P4                         *((volatile  uint8_t *)(0x42DEE110UL))
#define bFM_GPIO_PZR2_P5                          *((volatile  uint8_t *)(0x42DEE114UL))
#define bFM4_GPIO_PZR2_P5                         *((volatile  uint8_t *)(0x42DEE114UL))
#define bFM_GPIO_PZR2_P6                          *((volatile  uint8_t *)(0x42DEE118UL))
#define bFM4_GPIO_PZR2_P6                         *((volatile  uint8_t *)(0x42DEE118UL))

#define bFM_GPIO_PZR3_P0                          *((volatile  uint8_t *)(0x42DEE180UL))
#define bFM4_GPIO_PZR3_P0                         *((volatile  uint8_t *)(0x42DEE180UL))
#define bFM_GPIO_PZR3_P1                          *((volatile  uint8_t *)(0x42DEE184UL))
#define bFM4_GPIO_PZR3_P1                         *((volatile  uint8_t *)(0x42DEE184UL))
#define bFM_GPIO_PZR3_P2                          *((volatile  uint8_t *)(0x42DEE188UL))
#define bFM4_GPIO_PZR3_P2                         *((volatile  uint8_t *)(0x42DEE188UL))
#define bFM_GPIO_PZR3_P3                          *((volatile  uint8_t *)(0x42DEE18CUL))
#define bFM4_GPIO_PZR3_P3                         *((volatile  uint8_t *)(0x42DEE18CUL))
#define bFM_GPIO_PZR3_P4                          *((volatile  uint8_t *)(0x42DEE190UL))
#define bFM4_GPIO_PZR3_P4                         *((volatile  uint8_t *)(0x42DEE190UL))
#define bFM_GPIO_PZR3_P5                          *((volatile  uint8_t *)(0x42DEE194UL))
#define bFM4_GPIO_PZR3_P5                         *((volatile  uint8_t *)(0x42DEE194UL))

#define bFM_GPIO_PZR4_P0                          *((volatile  uint8_t *)(0x42DEE200UL))
#define bFM4_GPIO_PZR4_P0                         *((volatile  uint8_t *)(0x42DEE200UL))
#define bFM_GPIO_PZR4_P1                          *((volatile  uint8_t *)(0x42DEE204UL))
#define bFM4_GPIO_PZR4_P1                         *((volatile  uint8_t *)(0x42DEE204UL))
#define bFM_GPIO_PZR4_P6                          *((volatile  uint8_t *)(0x42DEE218UL))
#define bFM4_GPIO_PZR4_P6                         *((volatile  uint8_t *)(0x42DEE218UL))
#define bFM_GPIO_PZR4_P7                          *((volatile  uint8_t *)(0x42DEE21CUL))
#define bFM4_GPIO_PZR4_P7                         *((volatile  uint8_t *)(0x42DEE21CUL))
#define bFM_GPIO_PZR4_P8                          *((volatile  uint8_t *)(0x42DEE220UL))
#define bFM4_GPIO_PZR4_P8                         *((volatile  uint8_t *)(0x42DEE220UL))
#define bFM_GPIO_PZR4_P9                          *((volatile  uint8_t *)(0x42DEE224UL))
#define bFM4_GPIO_PZR4_P9                         *((volatile  uint8_t *)(0x42DEE224UL))

#define bFM_GPIO_PZR5_P0                          *((volatile  uint8_t *)(0x42DEE280UL))
#define bFM4_GPIO_PZR5_P0                         *((volatile  uint8_t *)(0x42DEE280UL))
#define bFM_GPIO_PZR5_P1                          *((volatile  uint8_t *)(0x42DEE284UL))
#define bFM4_GPIO_PZR5_P1                         *((volatile  uint8_t *)(0x42DEE284UL))
#define bFM_GPIO_PZR5_P2                          *((volatile  uint8_t *)(0x42DEE288UL))
#define bFM4_GPIO_PZR5_P2                         *((volatile  uint8_t *)(0x42DEE288UL))
#define bFM_GPIO_PZR5_P3                          *((volatile  uint8_t *)(0x42DEE28CUL))
#define bFM4_GPIO_PZR5_P3                         *((volatile  uint8_t *)(0x42DEE28CUL))
#define bFM_GPIO_PZR5_P4                          *((volatile  uint8_t *)(0x42DEE290UL))
#define bFM4_GPIO_PZR5_P4                         *((volatile  uint8_t *)(0x42DEE290UL))
#define bFM_GPIO_PZR5_P5                          *((volatile  uint8_t *)(0x42DEE294UL))
#define bFM4_GPIO_PZR5_P5                         *((volatile  uint8_t *)(0x42DEE294UL))
#define bFM_GPIO_PZR5_P6                          *((volatile  uint8_t *)(0x42DEE298UL))
#define bFM4_GPIO_PZR5_P6                         *((volatile  uint8_t *)(0x42DEE298UL))
#define bFM_GPIO_PZR5_P7                          *((volatile  uint8_t *)(0x42DEE29CUL))
#define bFM4_GPIO_PZR5_P7                         *((volatile  uint8_t *)(0x42DEE29CUL))

#define bFM_GPIO_PZR6_P0                          *((volatile  uint8_t *)(0x42DEE300UL))
#define bFM4_GPIO_PZR6_P0                         *((volatile  uint8_t *)(0x42DEE300UL))
#define bFM_GPIO_PZR6_P1                          *((volatile  uint8_t *)(0x42DEE304UL))
#define bFM4_GPIO_PZR6_P1                         *((volatile  uint8_t *)(0x42DEE304UL))
#define bFM_GPIO_PZR6_P2                          *((volatile  uint8_t *)(0x42DEE308UL))
#define bFM4_GPIO_PZR6_P2                         *((volatile  uint8_t *)(0x42DEE308UL))
#define bFM_GPIO_PZR6_P3                          *((volatile  uint8_t *)(0x42DEE30CUL))
#define bFM4_GPIO_PZR6_P3                         *((volatile  uint8_t *)(0x42DEE30CUL))
#define bFM_GPIO_PZR6_P4                          *((volatile  uint8_t *)(0x42DEE310UL))
#define bFM4_GPIO_PZR6_P4                         *((volatile  uint8_t *)(0x42DEE310UL))
#define bFM_GPIO_PZR6_P5                          *((volatile  uint8_t *)(0x42DEE314UL))
#define bFM4_GPIO_PZR6_P5                         *((volatile  uint8_t *)(0x42DEE314UL))
#define bFM_GPIO_PZR6_P6                          *((volatile  uint8_t *)(0x42DEE318UL))
#define bFM4_GPIO_PZR6_P6                         *((volatile  uint8_t *)(0x42DEE318UL))

